{"config": [{"config": {"arguments": {}, "name": "lambda_1", "output_shape": null, "batch_input_shape": [null, 80, 80, 3], "trainable": true, "input_dtype": "float32", "function_type": "lambda", "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00faA/home/xueyi/JupyterLib/CarND/CarND_Behavioral_Cloning_DL/model.py\u00da\b<lambda>R\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}, "class_name": "Lambda"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "nb_col": 5, "trainable": true, "bias": true, "b_constraint": null, "border_mode": "same", "b_regularizer": null, "W_constraint": null, "name": "convolution2d_1", "activation": "linear", "subsample": [2, 2], "nb_filter": 24, "init": "glorot_uniform", "nb_row": 5, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_1", "strides": [1, 1], "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "nb_col": 5, "trainable": true, "bias": true, "b_constraint": null, "border_mode": "same", "b_regularizer": null, "W_constraint": null, "name": "convolution2d_2", "activation": "linear", "subsample": [2, 2], "nb_filter": 36, "init": "glorot_uniform", "nb_row": 5, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_2", "strides": [1, 1], "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "nb_col": 5, "trainable": true, "bias": true, "b_constraint": null, "border_mode": "same", "b_regularizer": null, "W_constraint": null, "name": "convolution2d_3", "activation": "linear", "subsample": [2, 2], "nb_filter": 48, "init": "glorot_uniform", "nb_row": 5, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_3", "strides": [1, 1], "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "trainable": true, "bias": true, "b_constraint": null, "border_mode": "same", "b_regularizer": null, "W_constraint": null, "name": "convolution2d_4", "activation": "linear", "subsample": [1, 1], "nb_filter": 64, "init": "glorot_uniform", "nb_row": 3, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_4", "strides": [1, 1], "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "trainable": true, "bias": true, "b_constraint": null, "border_mode": "same", "b_regularizer": null, "W_constraint": null, "name": "convolution2d_5", "activation": "linear", "subsample": [1, 1], "nb_filter": 64, "init": "glorot_uniform", "nb_row": 3, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_5", "strides": [1, 1], "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "bias": true, "b_constraint": null, "b_regularizer": null, "input_dim": null, "W_constraint": null, "name": "dense_1", "init": "glorot_uniform", "output_dim": 1164}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "bias": true, "b_constraint": null, "b_regularizer": null, "input_dim": null, "W_constraint": null, "name": "dense_2", "init": "glorot_uniform", "output_dim": 100}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "bias": true, "b_constraint": null, "b_regularizer": null, "input_dim": null, "W_constraint": null, "name": "dense_3", "init": "glorot_uniform", "output_dim": 50}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "bias": true, "b_constraint": null, "b_regularizer": null, "input_dim": null, "W_constraint": null, "name": "dense_4", "init": "glorot_uniform", "output_dim": 10}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_9", "activation": "relu"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "bias": true, "b_constraint": null, "b_regularizer": null, "input_dim": null, "W_constraint": null, "name": "dense_5", "init": "glorot_uniform", "output_dim": 1}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}