{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00faA/home/xueyi/JupyterLib/CarND/CarND_Behavioral_Cloning_DL/model.py\u00da\b<lambda>R\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 80, 80, 3], "trainable": true, "output_shape": null, "output_shape_type": "raw", "arguments": {}, "name": "lambda_1", "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "dim_ordering": "tf", "bias": true, "W_constraint": null, "name": "convolution2d_1", "subsample": [2, 2], "b_regularizer": null, "nb_row": 5, "W_regularizer": null, "activation": "linear", "trainable": true, "init": "glorot_uniform", "nb_filter": 24, "nb_col": 5, "border_mode": "same", "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [1, 1], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_1", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "dim_ordering": "tf", "bias": true, "W_constraint": null, "name": "convolution2d_2", "subsample": [2, 2], "b_regularizer": null, "nb_row": 5, "W_regularizer": null, "activation": "linear", "trainable": true, "init": "glorot_uniform", "nb_filter": 36, "nb_col": 5, "border_mode": "same", "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [1, 1], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_2", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "dim_ordering": "tf", "bias": true, "W_constraint": null, "name": "convolution2d_3", "subsample": [2, 2], "b_regularizer": null, "nb_row": 5, "W_regularizer": null, "activation": "linear", "trainable": true, "init": "glorot_uniform", "nb_filter": 48, "nb_col": 5, "border_mode": "same", "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [1, 1], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_3", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "dim_ordering": "tf", "bias": true, "W_constraint": null, "name": "convolution2d_4", "subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "W_regularizer": null, "activation": "linear", "trainable": true, "init": "glorot_uniform", "nb_filter": 64, "nb_col": 3, "border_mode": "same", "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [1, 1], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_4", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "dim_ordering": "tf", "bias": true, "W_constraint": null, "name": "convolution2d_5", "subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "W_regularizer": null, "activation": "linear", "trainable": true, "init": "glorot_uniform", "nb_filter": 64, "nb_col": 3, "border_mode": "same", "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [1, 1], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_5", "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias": true, "name": "dense_1", "input_dim": null, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "trainable": true, "output_dim": 1164, "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias": true, "name": "dense_2", "input_dim": null, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "trainable": true, "output_dim": 100, "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias": true, "name": "dense_3", "input_dim": null, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "trainable": true, "output_dim": 50, "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias": true, "name": "dense_4", "input_dim": null, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "trainable": true, "output_dim": 10, "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias": true, "name": "dense_5", "input_dim": null, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "trainable": true, "output_dim": 1, "b_constraint": null}}]}